import cv2
import numpy as np


cap = cv2.VideoCapture(0)

lower_red1 = np.array([0, 100, 100])
upper_red1 = np.array([10, 255, 255])

lower_red2 = np.array([160, 100, 100])
upper_red2 = np.array([180, 255, 255])

points = []


while True:
    ret, frame = cap.read() # ret відповідає за зчитування кадру з відео потока. Повертає два значення: ret (булеве значення, яке вказує на успішність зчитування) та frame (сам кадр, який був зчитаний).
    if not ret:
        print("кадри скінчились")
        break

    frame = cv2.flip(frame, 1)
    hsv = cv2.cvtColor(frame, cv2.COLOR_BGR2HSV) # функція cvtColor використовується для перетворення кольорового зображення з одного колірного простору в інший. У цьому випадку, вона перетворює зображення з колірного простору BGR (Blue, Green, Red) в колірний простір HSV (Hue, Saturation, Value).

    mask1 = cv2.inRange(hsv, lower_red1, upper_red1) # функція inRange використовується для створення бінарної маски, де пікселі, які знаходяться в діапазоні від lower_red1 до upper_red1, будуть встановлені в 255 (білий), а всі інші - в 0 (чорний).
    mask2 = cv2.inRange(hsv, lower_red2, upper_red2)

    mask = cv2.bitwise_or(mask1, mask2) # функція bitwise_or виконує побітову операцію OR між двома масками (mask1 та mask2). Результатом буде нова маска, де пікселі будуть встановлені в 255 (білий) там, де хоча б одна з масок має значення 255, а всі інші пікселі будуть встановлені в 0 (чорний). 

    contours, _ = cv2.findContours(mask, cv2.RETR_EXTERNAL, cv2.CHAIN_APPROX_SIMPLE) # функція findContours використовується для знаходження контурів у бінарному зображенні (масці). Вона повертає список контурів та ієрархію контурів. У цьому випадку, ми використовуємо режим RETR_EXTERNAL, який дозволяє знаходити лише зовнішні контури, та метод CHAIN_APPROX_SIMPLE, який дозволяє зменшити кількість точок у контурах.

    for cnt in contours:
        area = cv2.contourArea(cnt) # функція contourArea використовується для обчислення площі контуру. Вона приймає контур (cnt) як аргумент і повертає його площу.
        if area > 1000:
            cv2.drawContours(frame, [cnt], 0, (0, 255, 0), 2) # функція drawContours використовується для малювання контурів на зображенні. Вона приймає кілька аргументів: зображення (frame), список контурів (у цьому випадку, ми передаємо один контур у вигляді списку [cnt]), індекс контуру (0, оскільки ми передаємо лише один контур), колір (зелений у форматі BGR - (0, 255, 0)) та товщину лінії (2).
            M = cv2.moments(cnt) # функція moments використовується для обчислення моментів контуру. Вона приймає контур (cnt) як аргумент і повертає словник, який містить різні моменти, такі як m00 (площа контуру), m10, m01 (момент першого порядку), m20, m11, m02 (момент другого порядку) та інші.
            if M["m00"] != 0: # перевіряємо, чи площа контуру (m00) не дорівнює нулю, щоб уникнути ділення на нуль при обчисленні координат центру контуру.
                cx = int(M["m10"] / M["m00"]) # обчислюємо координату x центру контуру, використовуючи моменти m10 та m00.
                cy = int(M["m01"] / M["m00"]) # обчислюємо координату y центру контуру, використовуючи моменти m01 та m00.

                cv2.circle(frame, (cx, cy), 5, (255, 0, 0), -1) # функція circle використовується для малювання кола на зображенні. Вона приймає кілька аргументів: зображення (frame), координати центру кола (cx, cy), радіус кола (5), колір (червоний у форматі BGR - (255, 0, 0)) та товщину лінії (-1 означає, що коло буде заповнене).
                points.append((cx, cy)) # додаємо координати центру контуру (cx, cy) до списку points.

                for i in range(1, len(points)):
                    if points[i-1] is None or points[i] is None or points[i] is None: # перевіряємо, чи є будь-яка з точок (points[i-1], points[i]) None, щоб уникнути помилки при малюванні лінії між двома точками. Якщо будь-яка з точок є None, ми пропускаємо цей цикл і переходимо до наступної ітерації за допомогою оператора continue.
                        continue

                    cv2.line(frame, points[i-1], points[i], (255, 255, 0), 2) # функція line використовується для малювання лінії на зображенні. Вона приймає кілька аргументів: зображення (frame), координати початкової точки (points[i-1]), координати кінцевої точки (points[i]), колір (синій у форматі BGR - (0, 0, 255)) та товщину лінії (2).

    cv2.imshow("Video", frame)
    cv2.imshow("Mask", mask)
    if cv2.waitKey(1) & 0xff == ord("q"):
        break

    



cap.release()
cv2.destroyAllWindows()